app/views/matches/index.html.erb

        <td>
        <% match.matches.each do |pair| %>
---
SELECT "matches".* FROM "matches"