app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("first_name", "last_name", "bio", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @profile = current_user.build_profile(profile_params)

    if @profile.save