app/controllers/users_controller.rb

  def toggle_admin
    @user = User.find(params[:id])
    @user.toggle!(:admin)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 58], ["LIMIT", 1]]
UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", "t"], ["updated_at", "2018-01-03 15:18:44.497156"], ["id", 50]]